// 1.Если а – четное посчитать а*б, иначе а+б

        // var a;
        // var b;
        // var c;
        // var result;


        // function foundA(a,b) {
        //     if (a % 2 == 0){
        //         result = a * b ;
        //     }
        //     else {
        //         result = a + b;
        //     }
        //     console.log(result);
        // }   

        // foundA(6,12);
//-----------------------------------------------------------------------------------------------------------

// 2.Определить какой четверти принадлежит точка с координатами (х,у)

    // var x;
    // var y;

    // function foundQuarter(x , y) {
    //     if (x < 0 && y < 0) {
    //         console.log("III - quarter");
    //     }
    //     else if (x > 0 && y > 0) {
    //         console.log("II - quarter");
    //     }
    //     else if (x > 0 && y < 0) {
    //         console.log("IV - quarter");
    //     }
    //     else if (x < 0 && y > 0) {
    //         console.log("I - quarter");
    //     }
    //     else {
    //         console.log("not found any quarter");
    //     }
        
    // }

    // foundQuarter(0,4)
//-------------------------------------------------------------------------------------------------------------
    // 3. Найти суммы только положительных из трех чисел

    // function sumNumbersOverZero (a,b,c) {
    //     if ((a < 0) || (b < 0) || (c < 0)) {
    //         console.log("one of number is wrong");
    //     }
    //     else {
    //         result = a + b + c;
    //         console.log(result);
    //     }
    // }

    // sumNumbersOverZero(-1,2,0)
//-------------------------------------------------------------------------------------------------------------


    // 4.Посчитать выражение (макс(а*б*с, а+б+с))+3
    // условие!!!!!!
    // 
//-------------------------------------------------------------------------------------------------------------

    //5.Написать программу определения оценки студента по его рейтингу, на основе следующих правил

    // var mark;
    // function rating(mark) {
    //     if (mark <=19) {
    //         console.log("F");
    //     }
    //     else if (mark >= 20 && mark <=39 ) { 
    //         console.log("E");
    //     }
    //     else if (mark >= 40 && mark <=59 ) { 
    //         console.log("D");
    //     }
    //     else if (mark >= 60 && mark <=74 ) { 
    //         console.log("C");
    //     }
    //     else if (mark >= 75 && mark <=89 ) { 
    //         console.log("B");
    //     }
    //     else {
    //         console.log("A");
    //     }
    // }

    // rating(12);


//-------------------------------------------------------------------------------------------------------------